; ModuleID = 'pass_bpf.c'
source_filename = "pass_bpf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ip6_srh_t = type { i8, i8, i8, i8, i8, i8, i16, [0 x %struct.in6_addr] }
%struct.in6_addr = type { i64, i64 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32 }
%struct.ip6_t = type { i32, i16, i8, i8, i64, i64, i64, i64 }

@__license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@llvm.used = appending global [8 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @__license, i32 0, i32 0), i8* bitcast (i32 (%struct.__sk_buff*)* @do_alert to i8*), i8* bitcast (i32 (%struct.__sk_buff*)* @do_drop to i8*), i8* bitcast (i32 (%struct.__sk_buff*)* @do_end_b6 to i8*), i8* bitcast (i32 (%struct.__sk_buff*)* @do_end_t to i8*), i8* bitcast (i32 (%struct.__sk_buff*)* @do_end_x to i8*), i8* bitcast (i32 (%struct.__sk_buff*)* @do_inc to i8*), i8* bitcast (i32 (%struct.__sk_buff*)* @do_pass to i8*)], section "llvm.metadata"

; Function Attrs: nounwind readonly uwtable
define %struct.ip6_srh_t* @get_srh(%struct.__sk_buff* nocapture readonly) local_unnamed_addr #0 !dbg !119 {
  tail call void @llvm.dbg.value(metadata %struct.__sk_buff* %0, metadata !123, metadata !DIExpression()), !dbg !146

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__license", scope: !2, file: !3, line: 124, type: !114, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0 (trunk 318052)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !56)
!3 = !DIFile(filename: "pass_bpf.c", directory: "/home/math/Thesis/VM/shared/eBPF-tests/seg6_pass")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_ret_code", file: !6, line: 869, size: 32, elements: !7)
!6 = !DIFile(filename: "./bpf.h", directory: "/home/math/Thesis/VM/shared/eBPF-tests/seg6_pass")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "BPF_OK", value: 0)
!9 = !DIEnumerator(name: "BPF_DROP", value: 2)
!10 = !DIEnumerator(name: "BPF_REDIRECT", value: 7)
!11 = !{!12, !13, !14, !20, !23, !25, !28, !31, !32, !33, !53, !54}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 24, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/math/Thesis/VM/shared/eBPF-tests/seg6_pass")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !18, line: 37, baseType: !19)
!18 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/math/Thesis/VM/shared/eBPF-tests/seg6_pass")
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !21, line: 23, baseType: !22)
!21 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/math/Thesis/VM/shared/eBPF-tests/seg6_pass")
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !24, line: 24, baseType: !20)
!24 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/math/Thesis/VM/shared/eBPF-tests/seg6_pass")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 26, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !18, line: 41, baseType: !27)
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 27, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !18, line: 44, baseType: !30)
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !24, line: 26, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !21, line: 26, baseType: !27)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_srh_t", file: !35, line: 91, size: 64, elements: !36)
!35 = !DIFile(filename: "./proto.h", directory: "/home/math/Thesis/VM/shared/eBPF-tests/seg6_pass")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !34, file: !35, line: 92, baseType: !19, size: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !34, file: !35, line: 93, baseType: !19, size: 8, offset: 8)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !35, line: 94, baseType: !19, size: 8, offset: 16)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "segments_left", scope: !34, file: !35, line: 95, baseType: !19, size: 8, offset: 24)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "first_segment", scope: !34, file: !35, line: 96, baseType: !19, size: 8, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !35, line: 97, baseType: !19, size: 8, offset: 40)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !34, file: !35, line: 98, baseType: !22, size: 16, offset: 48)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !34, file: !35, line: 100, baseType: !45, offset: 64)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, elements: !51)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !35, line: 86, size: 128, elements: !47)
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !46, file: !35, line: 87, baseType: !49, size: 64)
!49 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !46, file: !35, line: 88, baseType: !49, size: 64, offset: 64)
!51 = !{!52}
!52 = !DISubrange(count: 0)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!56 = !{!0, !57, !99, !104, !109}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "skb_seg6_change_field", scope: !2, file: !59, line: 230, type: !60, isLocal: true, isDefinition: true)
!59 = !DIFile(filename: "./bpf_api.h", directory: "/home/math/Thesis/VM/shared/eBPF-tests/seg6_pass")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64, !15, !25}
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !6, line: 817, size: 1152, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !83, !84, !85, !86, !87, !88, !89, !90, !91, !95, !96, !97, !98}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !6, line: 818, baseType: !32, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !65, file: !6, line: 819, baseType: !32, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !65, file: !6, line: 820, baseType: !32, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !65, file: !6, line: 821, baseType: !32, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !65, file: !6, line: 822, baseType: !32, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !65, file: !6, line: 823, baseType: !32, size: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !65, file: !6, line: 824, baseType: !32, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !65, file: !6, line: 825, baseType: !32, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !65, file: !6, line: 826, baseType: !32, size: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !65, file: !6, line: 827, baseType: !32, size: 32, offset: 288)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !65, file: !6, line: 828, baseType: !32, size: 32, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !65, file: !6, line: 829, baseType: !32, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !65, file: !6, line: 830, baseType: !80, size: 160, offset: 384)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 5)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !65, file: !6, line: 831, baseType: !32, size: 32, offset: 544)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !65, file: !6, line: 832, baseType: !32, size: 32, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !6, line: 833, baseType: !32, size: 32, offset: 608)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !65, file: !6, line: 834, baseType: !32, size: 32, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !65, file: !6, line: 835, baseType: !32, size: 32, offset: 672)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !65, file: !6, line: 838, baseType: !32, size: 32, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !65, file: !6, line: 839, baseType: !32, size: 32, offset: 736)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !65, file: !6, line: 840, baseType: !32, size: 32, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !65, file: !6, line: 841, baseType: !92, size: 128, offset: 800)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 4)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !65, file: !6, line: 842, baseType: !92, size: 128, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !65, file: !6, line: 843, baseType: !32, size: 32, offset: 1056)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !65, file: !6, line: 844, baseType: !32, size: 32, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !65, file: !6, line: 847, baseType: !32, size: 32, offset: 1120)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "skb_seg6_action_end_x", scope: !2, file: !59, line: 233, type: !101, isLocal: true, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!63, !64, !53}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "skb_seg6_action_end_t", scope: !2, file: !59, line: 234, type: !106, isLocal: true, isDefinition: true)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!63, !64, !25}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "skb_seg6_action_end_b6", scope: !2, file: !59, line: 235, type: !111, isLocal: true, isDefinition: true)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!63, !64, !33}
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !93)
!115 = !{i32 2, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{i32 1, !"wchar_size", i32 4}
!118 = !{!"clang version 6.0.0 (trunk 318052)"}
!119 = distinct !DISubprogram(name: "get_srh", scope: !3, file: !3, line: 15, type: !120, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{!33, !64}
!122 = !{!123, !124, !125, !126, !127, !141, !143, !144}
!123 = !DILocalVariable(name: "skb", arg: 1, scope: !119, file: !3, line: 15, type: !64)
!124 = !DILocalVariable(name: "ipver", scope: !119, file: !3, line: 16, type: !14)
!125 = !DILocalVariable(name: "data_end", scope: !119, file: !3, line: 17, type: !12)
!126 = !DILocalVariable(name: "cursor", scope: !119, file: !3, line: 18, type: !12)
!127 = !DILocalVariable(name: "ip", scope: !119, file: !3, line: 28, type: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6_t", file: !35, line: 73, size: 320, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !129, file: !35, line: 74, baseType: !27, size: 4, flags: DIFlagBitField, extraData: i64 0)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !129, file: !35, line: 75, baseType: !27, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !129, file: !35, line: 76, baseType: !27, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !129, file: !35, line: 77, baseType: !22, size: 16, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !129, file: !35, line: 78, baseType: !19, size: 8, offset: 48)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !129, file: !35, line: 79, baseType: !19, size: 8, offset: 56)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "src_hi", scope: !129, file: !35, line: 80, baseType: !49, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "src_lo", scope: !129, file: !35, line: 81, baseType: !49, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dst_hi", scope: !129, file: !35, line: 82, baseType: !49, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dst_lo", scope: !129, file: !35, line: 83, baseType: !49, size: 64, offset: 256)
!141 = !DILocalVariable(name: "_tmp", scope: !142, file: !3, line: 29, type: !12)
!142 = distinct !DILexicalBlock(scope: !119, file: !3, line: 29, column: 10)
!143 = !DILocalVariable(name: "srh", scope: !119, file: !3, line: 36, type: !33)
!144 = !DILocalVariable(name: "_tmp", scope: !145, file: !3, line: 37, type: !12)
!145 = distinct !DILexicalBlock(scope: !119, file: !3, line: 37, column: 11)
!146 = !DILocation(line: 15, column: 45, scope: !119)
!147 = !DILocation(line: 17, column: 41, scope: !119)
!148 = !{!149, !150, i64 80}
!149 = !{!"__sk_buff", !150, i64 0, !150, i64 4, !150, i64 8, !150, i64 12, !150, i64 16, !150, i64 20, !150, i64 24, !150, i64 28, !150, i64 32, !150, i64 36, !150, i64 40, !150, i64 44, !151, i64 48, !150, i64 68, !150, i64 72, !150, i64 76, !150, i64 80, !150, i64 84, !150, i64 88, !150, i64 92, !150, i64 96, !151, i64 100, !151, i64 116, !150, i64 132, !150, i64 136, !150, i64 140}
!150 = !{!"int", !151, i64 0}
!151 = !{!"omnipotent char", !152, i64 0}
!152 = !{!"Simple C/C++ TBAA"}
!153 = !DILocation(line: 17, column: 30, scope: !119)
!154 = !DILocation(line: 17, column: 22, scope: !119)
!155 = !DILocation(line: 17, column: 11, scope: !119)
!156 = !DILocation(line: 18, column: 41, scope: !119)
!157 = !{!149, !150, i64 76}
!158 = !DILocation(line: 18, column: 30, scope: !119)
!159 = !DILocation(line: 18, column: 22, scope: !119)
!160 = !DILocation(line: 18, column: 11, scope: !119)
!161 = !DILocation(line: 16, column: 14, scope: !119)
!162 = !DILocation(line: 22, column: 23, scope: !163)
!163 = distinct !DILexicalBlock(scope: !119, file: !3, line: 22, column: 9)
!164 = !DILocation(line: 22, column: 40, scope: !163)
!165 = !DILocation(line: 22, column: 9, scope: !119)
!166 = !DILocation(line: 25, column: 10, scope: !167)
!167 = distinct !DILexicalBlock(scope: !119, file: !3, line: 25, column: 9)
!168 = !{!151, !151, i64 0}
!169 = !DILocation(line: 25, column: 23, scope: !167)
!170 = !DILocation(line: 25, column: 9, scope: !119)
!171 = !DILocation(line: 29, column: 10, scope: !142)
!172 = !DILocation(line: 28, column: 19, scope: !119)
!173 = !DILocation(line: 30, column: 34, scope: !174)
!174 = distinct !DILexicalBlock(scope: !119, file: !3, line: 30, column: 9)
!175 = !DILocation(line: 30, column: 9, scope: !119)
!176 = !DILocation(line: 29, column: 10, scope: !119)
!177 = !DILocation(line: 33, column: 13, scope: !178)
!178 = distinct !DILexicalBlock(scope: !119, file: !3, line: 33, column: 9)
!179 = !{!180, !151, i64 6}
!180 = !{!"ip6_t", !150, i64 0, !150, i64 0, !150, i64 1, !181, i64 4, !151, i64 6, !151, i64 7, !182, i64 8, !182, i64 16, !182, i64 24, !182, i64 32}
!181 = !{!"short", !151, i64 0}
!182 = !{!"long long", !151, i64 0}
!183 = !DILocation(line: 33, column: 25, scope: !178)
!184 = !DILocation(line: 38, column: 21, scope: !185)
!185 = distinct !DILexicalBlock(scope: !119, file: !3, line: 38, column: 9)
!186 = !DILocation(line: 38, column: 36, scope: !185)
!187 = !DILocation(line: 33, column: 9, scope: !119)
!188 = !DILocation(line: 36, column: 23, scope: !119)
!189 = !DILocation(line: 37, column: 11, scope: !119)
!190 = !DILocation(line: 41, column: 14, scope: !191)
!191 = distinct !DILexicalBlock(scope: !119, file: !3, line: 41, column: 9)
!192 = !{!193, !151, i64 2}
!193 = !{!"ip6_srh_t", !151, i64 0, !151, i64 1, !151, i64 2, !151, i64 3, !151, i64 4, !151, i64 5, !181, i64 6, !151, i64 8}
!194 = !DILocation(line: 41, column: 19, scope: !191)
!195 = !DILocation(line: 44, column: 5, scope: !119)
!196 = !DILocation(line: 45, column: 1, scope: !119)
!197 = distinct !DISubprogram(name: "do_pass", scope: !3, file: !3, line: 48, type: !198, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{!63, !64}
!200 = !{!201}
